---
kind: method
id: M:Autodesk.Revit.DB.SweptProfile.Dispose
source: html/9618078f-c1f7-9121-1128-d066407c2340.htm
---
# Autodesk.Revit.DB.SweptProfile.Dispose Method

Releases all resources used by the SweptProfile

## Syntax (C#)
```csharp
public void Dispose()
```